import numpy as np

"""
创建数组
"""
a = np.array([2, 23, 4])  # list 1d
print(a)  # [2, 23, 4]

"""
指定数据 dtype
"""
a = np.array([2, 23, 4],dtype=np.int)
print(a.dtype)  # int64

a = np.array([2, 23, 4],dtype=np.int32)
print(a.dtype)  # int32

a = np.array([2, 23, 4],dtype=np.float)
print(a.dtype)  # float64

a = np.array([2, 23, 4],dtype=np.float32)
print(a.dtype)  # float32

"""
创建特定数据
"""
a = np.array([[2, 23, 4],[2, 23, 4]])  # 2d 矩阵 2行3列
print(a)  
'''
[[ 2 23  4]
 [ 2 32  4]]
'''

a = np.zeros((3, 4))  # 数据全为0，3行4列
print(a)  
'''
array([[ 0.,  0.,  0.,  0.],
    [ 0.,  0.,  0.,  0.],
    [ 0.,  0.,  0.,  0.]])
'''

a = np.ones((3, 4),dtype=np.int)  # 创建全一数组, 同时也能指定这些特定数据的 dtype
print(a)
'''
array([[1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1]])
'''

a = np.empty((3, 4))  # 创建全空数组, 其实每个值都是接近于零的数
print(a)
'''
[[0. 0. 0. 0.]
 [0. 0. 0. 0.]
 [0. 0. 0. 0.]]
'''

a = np.arange(10, 20, 2)  # 用 arange 创建连续数组, 10-19 的数据，2步长
print(a)
'''
[10, 12, 14, 16, 18]
'''

a = np.arange(12).reshape((3,4))  # 使用 reshape 改变数据的形状
print(a)
'''
[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
'''

a = np.linspace(1,10,20)  # 用 linspace 创建线段型数据
print(a)
'''
[ 1.          1.47368421  1.94736842  2.42105263  2.89473684  3.36842105
  3.84210526  4.31578947  4.78947368  5.26315789  5.73684211  6.21052632
  6.68421053  7.15789474  7.63157895  8.10526316  8.57894737  9.05263158
  9.52631579 10.        ]
'''

# 同样也能进行 reshape 工作
a = np.linspace(1, 10, 20).reshape((5, 4))  # 更改shape
print(a)
'''
[[ 1.          1.47368421  1.94736842  2.42105263]
 [ 2.89473684  3.36842105  3.84210526  4.31578947]
 [ 4.78947368  5.26315789  5.73684211  6.21052632]
 [ 6.68421053  7.15789474  7.63157895  8.10526316]
 [ 8.57894737  9.05263158  9.52631579 10.        ]]
'''
